app/controllers/accessories_controller.rb

  def index
    @accessories = Accessory.all
---
SELECT "accessories".* FROM "accessories"

  def create
    @accessory = Accessory.new(accessory_params)

    if @accessory.save
---
INSERT INTO "accessories" ("name", "image", "code", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "sepofjs"], ["image", "dsoijs"], ["code", "dpsijsd"], ["description", "dsois"], ["price", 1], ["created_at", "2019-07-03 05:36:15.550238"], ["updated_at", "2019-07-03 05:36:15.550238"]]