app/controllers/lightboards_controller.rb

  def index
    @lightboards = Lightboard.all
---
SELECT "lightboards".* FROM "lightboards"

  def create
    @lightboard = Lightboard.new(lightboard_params)

    if @lightboard.save
---
INSERT INTO "lightboards" ("name", "image", "code", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "seoifjw"], ["image", ""], ["code", ""], ["description", ""], ["created_at", "2019-07-04 02:32:59.872613"], ["updated_at", "2019-07-04 02:32:59.872613"]]

    def set_lightboard
      @lightboard = Lightboard.find(params[:id])
---
SELECT  "lightboards".* FROM "lightboards" WHERE "lightboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]