app/controllers/managements_controller.rb

SELECT "managements".* FROM "managements"
---
  def index
    @managements = Management.all