app/controllers/overviews_controller.rb

  def index
    @overviews = Overview.all
---
SELECT "overviews".* FROM "overviews"