app/controllers/studios_controller.rb

SELECT "studios".* FROM "studios"
---
  def index
    @studios = Studio.all

INSERT INTO "studios" ("name", "image", "code", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "s;s"], ["image", "sdpjs"], ["code", "fpjs"], ["description", "epfjwe"], ["price", 120], ["created_at", "2019-07-03 05:30:14.660241"], ["updated_at", "2019-07-03 05:30:14.660241"]]
---
  def create
    @studio = Studio.new(studio_params)

    if @studio.save